src/bsl/Enums/гкс_СостоянияРегистрации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>гкс_СостоянияРегистрации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Прибыл</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзвешенБрутто</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПринятоПоПревышениюМаксимальногоВеса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Регистрация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГотовКОтборуПроб</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзятыПробы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РезультатыПробПолучены</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КачествоПринято</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КачествоНеПринято</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыгрузкаРазрешена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выгружен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзвешенТара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Убыл</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПринято</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятыПробы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПогрузкаРазрешена</Name>
					<Comment>ERP-2029</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Погружен</Name>
					<Comment>ERP-2029</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/bsl/Enums/гкс_ТипРегистрации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>гкс_ТипРегистрации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Приемка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отгрузка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/bsl/Catalogs/гкс_СчитывателиUHFRFID.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>гкс_СчитывателиUHFRFID</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресСлужбы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПортаСлужбы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ApiUrl</Name>
					<Comment>REST end-point URL</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортСчитывателя</Name>
					<Comment>Имя последовательного порта USB считывателя </Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТаймаутСоединения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗащищенноеСоединение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Пользователи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/bsl/CommonModules/гкс_ИнтеграцияСКверионПовтИсп/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

#Область ВзаимодействиеСоСчитывателемRFIDМеток

// Получает параметры подключения к считывателю UHFRFID текущегопользователя
//
// Возвращаемое значение:
//   ФиксированнаяСтруктура - структура с параметрами подключения
//
Функция ПараметрыПодключенияКСчитывателю() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПараметрыПодключения = Новый Структура;
	
	МенеджерСчитывателей = Справочники.гкс_СчитывателиUHFRFID;
	СчитывательПользователя = МенеджерСчитывателей.СчитывательПользователя();
	
	Если ЗначениеЗаполнено(СчитывательПользователя) Тогда
		
		Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СчитывательПользователя, 
			"АдресСлужбы, НомерПортаСлужбы, ApiUrl, ПортСчитывателя, ЗащищенноеСоединение");
		
		ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ПараметрыПодключения, Реквизиты);
		
		ПараметрыПодключения.Вставить("ИспользоватьЗащищенноеСоединение", Реквизиты.ЗащищенноеСоединение);
		
		ПараметрыАутентифкации = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(СчитывательПользователя, 
																						"ПараметрыАутентифкации");
		Если ЗначениеЗаполнено(ПараметрыАутентифкации) Тогда
			ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ПараметрыПодключения, ПараметрыАутентифкации);	
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Новый ФиксированнаяСтруктура(ПараметрыПодключения);
	
КонецФункции

#КонецОбласти

// Возвращает массив возможных состояний в зависимости от типа регистрации
//
// Параметры:
//  ТипРегистрации  - ПеречислениеСсылка.гкс_ТипРегистрации - тип регистрации
//
// Возвращаемое значение:
//   ФиксированныйМассив   - массив состояний
//
Функция СостоянияРегистрацииКВыгрузкеВКверион(ТипРегистрации) Экспорт
	
	МенеджерСостояний = Перечисления.гкс_СостоянияРегистрации;
	
	Состояния = Новый Массив;
	
	Если ТипРегистрации = Перечисления.гкс_ТипРегистрации.Приемка Тогда
		
		Состояния.Добавить(МенеджерСостояний.Прибыл); 
		Состояния.Добавить(МенеджерСостояний.ПринятыПробы); 
		Состояния.Добавить(МенеджерСостояний.ВыгрузкаРазрешена);
		Состояния.Добавить(МенеджерСостояний.ВзвешенТара);  
		Состояния.Добавить(МенеджерСостояний.Выгружен);
		Состояния.Добавить(МенеджерСостояний.НеПринято);
	
	ИначеЕсли ТипРегистрации = Перечисления.гкс_ТипРегистрации.Отгрузка Тогда
		
		Состояния.Добавить(МенеджерСостояний.Прибыл); 
		Состояния.Добавить(МенеджерСостояний.ВзвешенТара); 
		Состояния.Добавить(МенеджерСостояний.Погружен);   
		Состояния.Добавить(МенеджерСостояний.ВзвешенБрутто);
		
	Иначе
		ВызватьИсключение НСтр("ru = 'Неверное значение параметра ТипРегистрации, ожидалось <Приемка> или <Отгрузка>'");		 
	КонецЕсли;	 
	
	Возврат Новый ФиксированныйМассив(Состояния);
	
КонецФункции 

#КонецОбласти
